package PS240412;

public class SAM_메이즈러너 {
	public static void main(String[] args) {
		/*
		 * 1. 참가자 이동
		 * 		1-1. 상하 -> 좌우 살펴보고, 배열 범위 내부이면서 벽이 없고, 출구까지의 최단거리가 
		 * 			 줄어든다면 그걸 우선으로 이동한다.(이동횟수는 저장해두어야 함.)
		 * 		1-2. 도달한 곳이 출구라면, 참가자를 탈출시킨다.
		 *		1-3. 모든 참가자가 탈출했다면, 게임을 종료시킨다. 
		 *
		 * 2. 정사각형 설정
		 * 		2-1. 모든 참가자가 이동했다면, 좌상단부터 크기가 2,3 ... n인 정사각형을
		 * 			 살펴보며 참가자와 출구가 최소 하나씩 포함되어있는지 확인하고 찾는다.
		 * 3. 회전
		 * 		3-1. 정사각형의 크기를 살펴보고, 그에 맞춰 행의 끝에서부터 돌며 각 열에 
		 * 			 삽입한다.(시계 방향 회전)
		 * 
		 * 4. 참가자가 존재하지 않고 게임이 끝났다면, 현재 출구 좌표와 이동거리 합을 출력한다. 
		 * 
		 */
		
		
		
	}

}
